from rich.console import Console
from rich.panel import Panel
from rich.align import Align

console = Console()


def welcome():

    title = """
██████╗  ██╗      ██████╗  ██╗   ██╗ ██████╗ 9
██╔════╝ ██║     ██╔═══██╗ ██║   ██║ ██╔══██╗
██║      ██║     ██║   ██║ ██║   ██║ ██║  ██║
██║      ██║     ██║   ██║ ██║   ██║ ██║  ██║
╚██████╗ ███████╗╚██████╔╝ ╚██████╔╝ ██████╔╝
 ╚═════╝ ╚══════╝ ╚═════╝   ╚═════╝  ╚═════╝
"""

    panel = Panel(
        Align.center(title),
        title="☁  Cloud Nine Protocol",
        subtitle="Intelligent Media Transfer",
        border_style="cyan"
    )

    console.print(panel)